{
    "projects": [
        {
            "title": "Creating of Thesaurus",
            "image": "thesaurus.jpg",
            "text": "The first of my projects is scientific research project from FRUCT lab by creating of russian thesaurus based on corpus of texts. I have developed module to extract synonymous from vocabulary and connect separated words from the thesaurus. That was not easy, because there were 1.4kk lines of words in vocabulary and each line contains from 5 to 20 words. We decided to solve that in a forehead, so the algorithm is slow but works. The result of our work you can see on link below (russian text).",
            "link": "https://www.mais-journal.ru/jour/article/view/735"
        },
        {
            "title": "First Android project",
            "image": "zoo_android.jpg",
            "text": "When I've started to learn Android, I selected one project where I will test new skill and approaches, and it's Yaroslavl Zoo application. I've started from research of ways to get information from their web site and desided to parse data using HTML parser lib. That was easy to use and find useful information. The most problem for me was Android's heap of technologies which I need to understand to start write something. Also was hard to create UI, problem not in XML, the problem in wide pack of components that were created for that long time.\nI've developed the first version of app and I started to evolve that. There was fine time of coding. And when I've finished this app, I was really happy for myself.",
            "link": "https://github.com/Alex-A4/AndroidZoo"
        },
        {
            "title": "MDinc Translator",
            "image": "mdincTranslator.jpg",
            "text": "When I've hear that MDinc team is gaining participants to their team, I've started to develop test-app, using YandexTranslate API, called MDinc Translator. That was easy to imagine how everything should work, but hard to write code where everything works. I was learning about JSON and working with network in Android. This is sad that there is no any solutions out of the box (and many other things in Android). I was using 2 packages: the first is for network requests, the second for JSON converting. To tell a truth, I was not understand how it works, before I start learning Flutter. At the end, I've joined to MDinc team and still participate in creating of their product.",
            "link": "https://github.com/Alex-A4/MDincTranslator"
        },
        {
            "title": "YarZoo with Flutter",
            "image": "zoo_flutter.jpg",
            "text": "After I've joined to MDinc team, I started to learn what Flutter is. At first, this was need to their project, but later I've fallen in love with Flutter. This is really fantastic cross-platform (and now multi-platform) framework to create applications with single code base. As in Android, I started to learn Flutter by creating my project, called Yaroslavl Zoo, but now with 'Flutter' suffix. I've developed that app for three weeks, with more complex UI and logic then on clean Android. Now, that app looks good, has more pages and works fine, instead of first version.",
            "link": "https://github.com/Alex-A4/ZooMobile"
        },
        {
            "title": "MDinc project",
            "image": "logo.jpg",
            "text": "I was one of two mobile developers in team. I've created UI using Flutter and helped to integrate external modules in native Java code. This is excellent experience of team working and creating real software wich will use people around the world.",
            "link": "http://www.mdinc.ru/en/"
        },
        {
            "title": "Diary of teacher",
            "image": "diary.jpg",
            "text": "The second my project on Flutter is middle size app that I created for my girlfriend whose was need to track her teaching information. She helped me to create design of app, my friend drawn logo and I started to coding. There was a lot of work, structuring of pages, business logic and architecture approaches. Also, I've integrated Firebase backend to store data, played with animation and much more. This is the first my big app, where I was really interesting to develope and integrating new technologies. There are BLOC and Scoped model architectures approaches, that I've used. Firebase backend to store text data and images, and also authentication with google.",
            "link": "https://github.com/Alex-A4/DiaryOfTeacher"
        },
        {
            "title": "Web site on Flutter",
            "image": "site.png",
            "text": "This site also made with Flutter, and it means that Flutter is full multi-platform framework. I've used default Flutter code and widgets, used basic animations and rules. All of dart code was converted to JS and can be run on any browser."
        }
    ]
}
